{"format": "layers-model", "modelTopology": {"training_config": {"metrics": ["accuracy"], "weighted_metrics": null, "sample_weight_mode": null, "loss": "binary_crossentropy", "optimizer_config": {"config": {"decay": 0.0, "epsilon": 1e-07, "beta_2": 0.9990000128746033, "beta_1": 0.8999999761581421, "name": "Adam", "amsgrad": false, "learning_rate": 9.999999974752427e-07}, "class_name": "Adam"}, "loss_weights": null}, "backend": "tensorflow", "model_config": {"config": {"name": "model", "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "config": {"name": "input_1", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 798, 128], "ragged": false}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "conv1d", "config": {"kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last", "activity_regularizer": null, "padding": "valid", "kernel_size": [15], "activation": "linear", "kernel_constraint": null, "dilation_rate": [1], "strides": [4], "kernel_regularizer": null, "filters": 98, "bias_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "dtype": "float32", "name": "conv1d"}, "class_name": "Conv1D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "batch_normalization", "config": {"scale": true, "gamma_regularizer": null, "gamma_constraint": null, "axis": [2], "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "name": "batch_normalization", "trainable": true, "dtype": "float32"}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv1d", 0, 0, {}]]]}, {"name": "activation", "config": {"name": "activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"name": "dropout", "config": {"seed": null, "rate": 0.8, "name": "dropout", "trainable": true, "dtype": "float32", "noise_shape": null}, "class_name": "Dropout", "inbound_nodes": [[["activation", 0, 0, {}]]]}, {"name": "gru", "config": {"kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "kernel_regularizer": null, "reset_after": false, "recurrent_initializer": {"config": {"gain": 1.0, "dtype": "float32", "seed": null}, "class_name": "Orthogonal"}, "return_state": false, "use_bias": true, "stateful": false, "dtype": "float32", "name": "gru", "recurrent_regularizer": null, "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "return_sequences": true, "implementation": 1, "dropout": 0.0, "time_major": false, "activation": "tanh", "kernel_constraint": null, "recurrent_constraint": null, "unroll": false, "bias_regularizer": null, "bias_constraint": null, "units": 64}, "class_name": "GRU", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"name": "dropout_1", "config": {"seed": null, "rate": 0.8, "name": "dropout_1", "trainable": true, "dtype": "float32", "noise_shape": null}, "class_name": "Dropout", "inbound_nodes": [[["gru", 0, 0, {}]]]}, {"name": "batch_normalization_1", "config": {"scale": true, "gamma_regularizer": null, "gamma_constraint": null, "axis": [2], "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "name": "batch_normalization_1", "trainable": true, "dtype": "float32"}, "class_name": "BatchNormalization", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "gru_1", "config": {"kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "kernel_regularizer": null, "reset_after": false, "recurrent_initializer": {"config": {"gain": 1.0, "dtype": "float32", "seed": null}, "class_name": "Orthogonal"}, "return_state": false, "use_bias": true, "stateful": false, "dtype": "float32", "name": "gru_1", "recurrent_regularizer": null, "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "return_sequences": true, "implementation": 1, "dropout": 0.0, "time_major": false, "activation": "tanh", "kernel_constraint": null, "recurrent_constraint": null, "unroll": false, "bias_regularizer": null, "bias_constraint": null, "units": 64}, "class_name": "GRU", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "dropout_2", "config": {"seed": null, "rate": 0.8, "name": "dropout_2", "trainable": true, "dtype": "float32", "noise_shape": null}, "class_name": "Dropout", "inbound_nodes": [[["gru_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "config": {"scale": true, "gamma_regularizer": null, "gamma_constraint": null, "axis": [2], "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "center": true, "momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "name": "batch_normalization_2", "trainable": true, "dtype": "float32"}, "class_name": "BatchNormalization", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "dropout_3", "config": {"seed": null, "rate": 0.8, "name": "dropout_3", "trainable": true, "dtype": "float32", "noise_shape": null}, "class_name": "Dropout", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "time_distributed", "config": {"layer": {"config": {"kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "sigmoid", "bias_constraint": null, "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense", "trainable": true, "units": 1, "use_bias": true}, "class_name": "Dense"}, "name": "time_distributed", "trainable": true, "dtype": "float32"}, "class_name": "TimeDistributed", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}], "output_layers": [["time_distributed", 0, 0]]}, "class_name": "Model"}, "keras_version": "2.2.4-tf"}, "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v3.7.0", "weightsManifest": [{"weights": [{"name": "batch_normalization/gamma", "shape": [98], "dtype": "float32"}, {"name": "batch_normalization/beta", "shape": [98], "dtype": "float32"}, {"name": "batch_normalization/moving_mean", "shape": [98], "dtype": "float32"}, {"name": "batch_normalization/moving_variance", "shape": [98], "dtype": "float32"}, {"name": "batch_normalization_1/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_1/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_2/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_2/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_2/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_2/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv1d/kernel", "shape": [15, 128, 98], "dtype": "float32"}, {"name": "conv1d/bias", "shape": [98], "dtype": "float32"}, {"name": "gru/kernel", "shape": [98, 192], "dtype": "float32"}, {"name": "gru/recurrent_kernel", "shape": [64, 192], "dtype": "float32"}, {"name": "gru/bias", "shape": [192], "dtype": "float32"}, {"name": "gru_1/kernel", "shape": [64, 192], "dtype": "float32"}, {"name": "gru_1/recurrent_kernel", "shape": [64, 192], "dtype": "float32"}, {"name": "gru_1/bias", "shape": [192], "dtype": "float32"}, {"name": "time_distributed/kernel", "shape": [64, 1], "dtype": "float32"}, {"name": "time_distributed/bias", "shape": [1], "dtype": "float32"}], "paths": ["group1-shard1of1.bin"]}]}